blog/speaking-of-chess.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-18 Wed 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Speaking Of Chess: Speech-Enabling Emacs Chess In Emacspeak</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Speaking Of Chess: Speech-Enabling Emacs Chess In Emacspeak</h1>
<div id="outline-container-orgc765764" class="outline-2">
<h2 id="orgc765764"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgde6f45e" class="outline-3">
<h3 id="orgde6f45e"><span class="section-number-3">1.1</span> Research question:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
What type of spoken feedback does one need to:
</p>

<ol class="org-ol">
<li>Learn Chess.</li>
<li>Examine and learn from games.</li>
<li>Play effectively.</li>
<li>View the state of the game from different perspectives during a game.</li>
<li>Provide auditory feedback that is both succinct and maximally informative.</li>
<li>Arrive at  a spoken notation for speaking various game states
that is both expressive and time-efficient.</li>
</ol>
</div>
</div>


<div id="outline-container-org0baa7ae" class="outline-3">
<h3 id="org0baa7ae"><span class="section-number-3">1.2</span> Speech-Enabling Chess In Emacspeak</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To answer some or all of the above questions, I speech-enabled Emacs
Chess last weekend via module <a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-chess.el#L41">emacspeak-chess.el</a>  — see <a href="http://tvraman.github.io/emacspeak/manual/emacspeak_002dchess.html#emacspeak_002dchess">User Manual</a>
for complete end-user documentation.
</p>

<p>
Module <code>emacspeak-chess</code> speech-enables Emacs Chess by:
</p>

<ol class="org-ol">
<li>Providing interactive commands that let the user navigate and browse the
chessboard along the eight compass directions from the current square.</li>
<li>Spoken output uses audio-formatting  — subtle changes in voice
characteristics backed up by auditory icons  — to indicate the
color of squares and pieces.</li>
<li>Speaking each  current  move as it happens.</li>
<li>Adding the same spoken output to <code>emacs chess</code> commands for
moving back and forth through a game.</li>
</ol>


<p>
In the above, all of the heavy lifting is done by three  functions:
</p>

<ul class="org-ul">
<li><a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-chess.el#L146-L178">emacspeak-chess-describe-square</a>: Speak state of current square.</li>
</ul>
<ul class="org-ul">
<li><a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-chess.el#L1-L269">emacspeak-chess-collect-squares</a>: Collect squares along a given rank,
file, or diagonal, starting at and including the current square.
<ul class="org-ul">
<li><a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-chess.el#L146-L383">emacspeak-chess-describe-move</a>: Describe current move.</li>
</ul></li>
</ul>


<p>
Share And Enjoy!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-12-18 Wed 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2019-12-18 Wed 07:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
